INSERT INTO sport_name(name)
VALUES ('Бодибилдинг'),
       ('Плавание'),
       ('Тяжелая Атлетика'),
       ('Кроссфит'),
       ('Бег'),
       ('Йога');

INSERT INTO coach_education(name_education)
VALUES ('Колледж'),
       ('Интститут'),
       ('Курсы');

INSERT INTO coach(last_name, first_name, education_id, sport_id, years_experience)
VALUES ('Голубочкин', 'Дмитрий', 2, 1, 25),
       ('Спасокукотский', 'Юрий', 1, 4, 7),
       ('Иванов', 'Олег', 3, 6, 12),
       ('Семенова', 'Ирина', 2, 2, 13),
       ('Явлинская', 'Оксана', 1, 5, 5),
       ('Бодюк', 'Василий', 2, 2, 12),
       ('Бодюк', 'Иван', 2, 3, 11),
       ('Бодюк', 'Валерий', 2, 4, 9);

INSERT INTO client_status(status_name)
VALUES ('VIP'),
       ('SPA-ONLY'),
       ('POOL-ONLY'),
       ('GYM-ONLY');

INSERT INTO client(last_name, first_name, status_id, days_left)
VALUES ('Иванов', 'Иван', 1, 345),
       ('Семенов', 'Семен', 2, 185),
       ('Александров', 'Александр', 3, 300),
       ('Дмитриев', 'Дмитрий', 4, 145),
       ('Олегов', 'Олег', 1, 445),
       ('Валериев', 'Валерий', 3, 348),
       ('Шилдт', 'Герберт', 1, 315),
       ('Басилиев', 'Басилий', 4, 333),
       ('Сергеев', 'Сергей', 1, 243),
       ('Алексеев', 'Алексей', 1, 312),
       ('Ростиславов', 'Ростислав', 2, 0),
       ('Вячеславов', 'Вячеслав', 1, 45),
       ('Дауни', 'Младший', 1, 111),
       ('Шаудоу', 'Фиенд', 2, 0),
       ('Войд', 'Спирит', 2, 0),
       ('Ковалев', 'Иван', 1, 545),
       ('Березовский', 'Дмитрий', 4, 145),
       ('Мешков', 'Мешок', 2, 321),
       ('Шконвов', 'Иван', 4, 35),
       ('Сильченко', 'Олег', 1, 45);

INSERT INTO schedule(coach_id, sport_id, duration_hours)
VALUES (1, 1, 3),
       (2, 4, 1),
       (3, 2, 1),
       (4, 4, 1),
       (5, 5, 1),
       (6, 2, 1),
       (7, 3, 2),
       (8, 4, 1);

-- INSERT INTO traning(coach_id, sport_id, client_id, price, shedule_id)
-- VALUES ()